XJU-Hurricane/STM32_Template/FreeRTOS/f429/Drivers/bsp/Src/uart.c
/**
 * @file    uart.c
 * @author  Deadline039
 * @version 1.0
 * @date    2023-07-24
 * @note    STM32F429串口(usart1->uart8)的初始化函数以及中断服务函数
 *          如果启用了串口1,printf函数将会被重定义为从串口1输出
 *          如果使用串口DMA, 根据需要设置缓冲区大小, 在串口初始化的DMA
 *          Init函数中
 * @warning 要使用相关函数请预先在uart.h里打开宏定义
 *
 */

#include "uart.h"
#include "dma_uart.h"
#include "stdarg.h"
#include "string.h"

/* 如果使用os,则包括下面的头文件即可 */
#if SYS_SUPPORT_OS
#include "FreeRTOS.h" /* os 使用 */
#endif                /* SYS_SUPPORT_OS */

static uint8_t g_uart_tx_buf[TX_BUF_LEN]; /* 发送缓冲区 */

/*******************************************************************************
 * @defgroup 串口1
 * @{
 */

#ifdef EN_USART1
UART_HandleTypeDef g_usart1_handle;
#if EN_USART1_RX
#if !USART1_USE_DMA_RX
uint8_t g_usart1_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_usart1_rx_status = 0;
static uint8_t g_usart1_recv_it_buf[RECV_IT_BUF_SIZE];
#endif /* !USART1_USE_DMA_RX */

/**
 * @brief 串口1中断服务函数
 */
void USART1_IRQHandler(void) {

#if USART1_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_usart1_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_usart1_handle);
        uart_dmarx_idle_callback(&g_usart1_handle);
    }
#endif /* USART1_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_usart1_handle); /* 调用HAL库中断处理公用函数 */
}
#endif /* EN_USART1_RX */
/**
 * @brief 串口1初始化
 * @param bound 波特率
 */
void usart1_init(uint32_t bound) {
    g_usart1_handle.Instance = USART1;
    g_usart1_handle.Init.BaudRate = bound;
    g_usart1_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_usart1_handle.Init.StopBits = UART_STOPBITS_1;
    g_usart1_handle.Init.Parity = UART_PARITY_NONE;
    g_usart1_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_usart1_handle.Init.Mode = UART_MODE_TX_RX;

    HAL_UART_Init(&g_usart1_handle);

#if USART1_USE_DMA_TX
    /* 打开DMA发送 */
    usart1_dmatx_init(2048, 128);
#endif /* USART1_USE_DMA_TX */

#if EN_USART1_RX
#if USART1_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    usart1_dmarx_init(4096, 128);
#else  /* USART1_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_usart1_handle, (uint8_t *)g_usart1_recv_it_buf,
                        RECV_IT_BUF_SIZE);
#endif /* USART1_USE_DMA_RX */
#endif /* EN_USART1_RX */
}

#endif /* EN_USART1 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口2
 * @{
 */

#ifdef EN_USART2
UART_HandleTypeDef g_usart2_handle;
#if EN_USART2_RX
#if !USART2_USE_DMA_RX
uint8_t g_usart2_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_usart2_rx_status = 0;
static uint8_t g_usart2_recv_it_buf[RECV_IT_BUF_SIZE];
#endif /* !USART2_USE_DMA_RX */
/**
 * @brief 串口2中断服务函数
 */
void USART2_IRQHandler(void) {

#if USART2_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_usart2_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_usart2_handle);
        uart_dmarx_idle_callback(&g_usart2_handle);
    }
#endif /* USART2_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_usart2_handle); /* 调用HAL库中断处理公用函数 */
}
#endif /* EN_USART2_RX */
/**
 * @brief 串口2初始化
 * @param bound 波特率
 */
void usart2_init(uint32_t bound) {
    g_usart2_handle.Instance = USART2;
    g_usart2_handle.Init.BaudRate = bound;
    g_usart2_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_usart2_handle.Init.StopBits = UART_STOPBITS_1;
    g_usart2_handle.Init.Parity = UART_PARITY_NONE;
    g_usart2_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_usart2_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_usart2_handle);

#if USART2_USE_DMA_TX
    /* 打开DMA发送 */
    usart2_dmatx_init(2048, 128);
#endif /* USART2_USE_DMA_TX */

#if EN_USART2_RX
#if USART2_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    usart2_dmarx_init(4096, 128);
#else  /* USART2_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_usart2_handle, (uint8_t *)g_usart2_recv_it_buf,
                        RECV_IT_BUF_SIZE);
#endif /* USART2_USE_DMA_RX */
#endif /* EN_USART2_RX */
}
#endif /* EN_USART2 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口3
 * @{
 */

#ifdef EN_USART3
UART_HandleTypeDef g_usart3_handle;
#if EN_USART3_RX
#if !USART3_USE_DMA_RX
uint8_t g_usart3_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_usart3_rx_status = 0;
static uint8_t g_usart3_recv_it_buf[RECV_IT_BUF_SIZE];
#endif /* !USART3_USE_DMA_RX */
/**
 * @brief 串口3中断服务函数
 */
void USART3_IRQHandler(void) {

#if USART3_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_usart3_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_usart3_handle);
        uart_dmarx_idle_callback(&g_usart3_handle);
    }
#endif /* USART3_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_usart3_handle); /* 调用HAL库中断处理公用函数 */
}
#endif /* EN_USART3_RX */
/**
 * @brief 串口3初始化
 * @param bound 波特率
 */
void usart3_init(uint32_t bound) {
    g_usart3_handle.Instance = USART3;
    g_usart3_handle.Init.BaudRate = bound;
    g_usart3_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_usart3_handle.Init.StopBits = UART_STOPBITS_1;
    g_usart3_handle.Init.Parity = UART_PARITY_NONE;
    g_usart3_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_usart3_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_usart3_handle);

#if USART3_USE_DMA_TX
    /* 打开DMA发送 */
    usart3_dmatx_init(2048, 128);
#endif /* USART3_USE_DMA_TX */

#if EN_USART3_RX
#if USART3_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    usart3_dmarx_init(4096, 128);
#else  /* USART3_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_usart3_handle, (uint8_t *)g_usart3_recv_it_buf,
                        RECV_IT_BUF_SIZE);
#endif /* USART3_USE_DMA_RX */
#endif /* EN_USART3_RX */
}
#endif /* EN_USART3 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口4
 * @{
 */

#ifdef EN_UART4
UART_HandleTypeDef UART4_Handler;
#if EN_UART4_RX
#if !UART4_USE_DMA_RX
uint8_t g_uart4_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart4_rx_status = 0;
static uint8_t g_uart4_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART4_USE_DMA_RX */
/**
 * @brief 串口4中断服务函数
 */
void UART4_IRQHandler(void) {

#if UART4_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&UART4_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&UART4_Handler);
        uart_dmarx_idle_callback(&UART4_Handler);
    }
#endif /* UART4_USE_IDLE_IT */

    HAL_UART_IRQHandler(&UART4_Handler); /* 调用HAL库中断处理公用函数 */
}
#endif /* EN_UART4_RX */
/**
 * @brief 串口4初始化
 * @param bound 波特率
 */
void uart4_init(uint32_t bound) {
    UART4_Handler.Instance = UART4;
    UART4_Handler.Init.BaudRate = bound;
    UART4_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    UART4_Handler.Init.StopBits = UART_STOPBITS_1;
    UART4_Handler.Init.Parity = UART_PARITY_NONE;
    UART4_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UART4_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&UART4_Handler);

#if UART4_USE_DMA_TX
    /* 打开DMA发送 */
    uart4_dmatx_init(2048, 128);
#endif /* UART4_USE_DMA_TX */

