XJU-Hurricane/STM32_Template/FreeRTOS/f429/Drivers/bsp/Src/uart.c
#if EN_UART4_RX
#if UART4_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    uart4_dmarx_init(4096, 128);
#else  /* UART4_USE_DMA_RX */
    HAL_UART_Receive_IT(&UART4_Handler, (uint8_t *)g_uart4_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* UART4_USE_DMA_RX */
#endif /* EN_UART4_RX */
}
#endif /* EN_UART4 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口5
 * @{
 */

#ifdef EN_UART5
UART_HandleTypeDef UART5_Handler;
#if EN_UART5_RX
#if !UART5_USE_DMA_RX
uint8_t g_uart5_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart5_rx_status = 0;
static uint8_t g_uart5_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART5_USE_DMA_RX */
/**
 * @brief 串口5中断服务函数
 */
void UART5_IRQHandler(void) {

#if UART5_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&UART5_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&UART5_Handler);
        uart_dmarx_idle_callback(&UART5_Handler);
    }
#endif /* UART5_USE_IDLE_IT */

    HAL_UART_IRQHandler(&UART5_Handler); /* 调用HAL库中断处理公用函数 */
}
#endif /* EN_UART5_RX */
/**
 * @brief 串口5初始化
 * @param bound 波特率
 */
void uart5_init(uint32_t bound) {
    UART5_Handler.Instance = UART5;
    UART5_Handler.Init.BaudRate = bound;
    UART5_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    UART5_Handler.Init.StopBits = UART_STOPBITS_1;
    UART5_Handler.Init.Parity = UART_PARITY_NONE;
    UART5_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UART5_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&UART5_Handler);

#if UART5_USE_DMA_TX
    /* 打开DMA发送 */
    uart5_dmatx_init(2048, 128);
#endif /* UART5_USE_DMA_TX */

#if EN_UART5_RX
#if UART5_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    uart5_dmarx_init(4096, 128);
#else  /* UART5_USE_DMA_RX */
    HAL_UART_Receive_IT(&UART5_Handler, (uint8_t *)g_uart5_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* UART5_USE_DMA_RX */
#endif /* EN_UART5_RX */
}
#endif /* EN_UART5 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口6
 * @{
 */

#ifdef EN_USART6
UART_HandleTypeDef g_usart6_handle;
#if EN_USART6_RX
#if !USART6_USE_DMA_RX
uint8_t g_usart6_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_usart6_rx_status = 0;
static uint8_t g_usart6_recv_it_buf[RECV_IT_BUF_SIZE];
#endif /* !USART6_USE_DMA_RX */
/**
 * @brief 串口6中断服务函数
 */
void USART6_IRQHandler(void) {

#if USART6_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_usart6_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_usart6_handle);
        uart_dmarx_idle_callback(&g_usart6_handle);
    }
#endif /* USART6_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_usart6_handle); /* 调用HAL库中断处理公用函数 */
}
#endif /* EN_USART6_RX */
/**
 * @brief 串口6初始化
 * @param bound 波特率
 */
void usart6_init(uint32_t bound) {
    g_usart6_handle.Instance = USART6;
    g_usart6_handle.Init.BaudRate = bound;
    g_usart6_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_usart6_handle.Init.StopBits = UART_STOPBITS_1;
    g_usart6_handle.Init.Parity = UART_PARITY_NONE;
    g_usart6_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_usart6_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_usart6_handle);

#if USART6_USE_DMA_TX
    /* 打开DMA发送 */
    usart6_dmatx_init(2048, 128);
#endif /* USART6_USE_DMA_TX */

#if EN_USART6_RX
#if USART6_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    usart6_dmarx_init(4096, 128);
#else  /* USART6_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_usart6_handle, (uint8_t *)g_usart6_recv_it_buf,
                        RECV_IT_BUF_SIZE);
#endif /* USART6_USE_DMA_RX */
#endif /* EN_USART6_RX */
}
#endif /* EN_USART6 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口7
 * @{
 */

#ifdef EN_UART7
UART_HandleTypeDef UART7_Handler;
#if EN_UART7_RX
#if !UART7_USE_DMA_RX
uint8_t g_uart7_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart7_rx_status = 0;
static uint8_t g_uart7_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART7_USE_DMA_RX */
/**
 * @brief 串口7中断服务函数
 */
void UART7_IRQHandler(void) {

#if UART7_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&UART7_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&UART7_Handler);
        uart_dmarx_idle_callback(&UART7_Handler);
    }
#endif /* UART7_USE_IDLE_IT */

    HAL_UART_IRQHandler(&UART7_Handler); /* 调用HAL库中断处理公用函数 */
}
#endif /* EN_UART7_RX */
/**
 * @brief 串口7初始化
 * @param bound 波特率
 */
void uart7_init(uint32_t bound) {
    UART7_Handler.Instance = UART7;
    UART7_Handler.Init.BaudRate = bound;
    UART7_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    UART7_Handler.Init.StopBits = UART_STOPBITS_1;
    UART7_Handler.Init.Parity = UART_PARITY_NONE;
    UART7_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UART7_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&UART7_Handler);

#if UART7_USE_DMA_TX
    /* 打开DMA发送 */
    uart7_dmatx_init(2048, 128);
#endif /* UART7_USE_DMA_TX */

#if EN_UART7_RX
#if UART7_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    uart7_dmarx_init(4096, 128);
#else  /* UART7_USE_DMA_RX */
    HAL_UART_Receive_IT(&UART7_Handler, (uint8_t *)g_uart7_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* UART7_USE_DMA_RX */
#endif /* EN_UART7_RX */
}
#endif /* EN_UART7 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口8
 * @{
 */

#ifdef EN_UART8
UART_HandleTypeDef UART8_Handler;
#if EN_UART8_RX
#if !UART8_USE_DMA_RX
uint8_t g_uart8_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart8_rx_status = 0;
static uint8_t g_uart8_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART8_USE_DMA_RX */
/**
 * @brief 串口8中断服务函数
 */
void UART8_IRQHandler(void) {

#if UART8_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&UART8_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&UART8_Handler);
        uart_dmarx_idle_callback(&UART8_Handler);
    }
#endif /* UART8_USE_IDLE_IT */

    HAL_UART_IRQHandler(&UART8_Handler); /* 调用HAL库中断处理公用函数 */
}
#endif /* EN_UART8_RX */
/**
 * @brief 串口8初始化
 * @param bound 波特率
 */
void uart8_init(uint32_t bound) {
    UART8_Handler.Instance = UART8;
    UART8_Handler.Init.BaudRate = bound;
    UART8_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    UART8_Handler.Init.StopBits = UART_STOPBITS_1;
    UART8_Handler.Init.Parity = UART_PARITY_NONE;
    UART8_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UART8_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&UART8_Handler);

#if UART8_USE_DMA_TX
    /* 打开DMA发送 */
    uart8_dmatx_init(2048, 128);
#endif /* UART8_USE_DMA_TX */

