XJU-Hurricane/STM32_Template/FreeRTOS/f429/Drivers/bsp/Src/uart.c
/*******************************************************************************
 * @defgroup 如果启用了串口1,重定义printf, 支持AC5, AC6, GCC
 * @{
 */

#ifdef EN_USART1
#if defined(__ARMCC_VERSION) /* Compiler */

#if (__ARMCC_VERSION >= 6010050) /* 使用AC6编译器时 */

__asm(".global __use_no_semihosting\n\t"); /* 声明不使用半主机模式 */
/* AC6下需要声明main函数为无参数格式，否则部分例程可能出现半主机模式 */
__asm(".global __ARM_use_no_argv \n\t");

#elif ((__ARMCC_VERSION >= 5000000) &&                                         \
       (__ARMCC_VERSION < 6000000)) /* 使用AC5编译器 */
/* 使用AC5编译器时, 要在这里定义__FILE 和 不使用半主机模式 */

/* 关闭多字节警告 */
#pragma diag_suppress 870

#pragma import(__use_no_semihosting)

struct __FILE {
    int handle;
    /* Whatever you require here. If the only file you are using is */
    /* standard output using printf() for debugging, no file handling */
    /* is required. */
};
#endif /* __ARMCC_VERSION */
/* 不使用半主机模式，至少需要重定义_ttywrch\_sys_exit\_sys_command_string函数,以同时兼容AC6和AC5模式
 */
int _ttywrch(int ch) {
    ch = ch;
    return ch;
}

/* 定义_sys_exit()以避免使用半主机模式 */
void _sys_exit(int x) {
    x = x;
}

char *_sys_command_string(char *cmd, int len) {
    return NULL;
}
/* FILE 在 stdio.h里面定义. */
FILE __stdout;

/* MDK下需要重定义fputc函数, printf函数最终会通过调用fputc输出字符串到串口 */
int fputc(int ch, FILE *f) {
    while ((USART1->SR & 0X40) == 0)
        ; /* 等待上一个字符发送完成 */

    USART1->DR = (uint8_t)ch; /* 将要发送的字符 ch 写入到DR寄存器 */
    return ch;
}

#elif (defined(__GNUC__))            /* 使用ARM GCC编译器 */

/* 使用ARM GCC需要添加-u _printf_float以支持浮点数 */
#pragma import(__use_no_semihosting) /* 不适用半主机模式 */
/*重新定义__write函数*/
int _write(int fd, char *ptr, int len) {
    HAL_UART_Transmit(&g_usart1_handle, (uint8_t *)ptr, len, 0xFFFF);
    return len;
}

/*定义_sys_exit()以避免使用半主机模式*/
void _sys_exit(int x) {
    x = x;
}

#endif /* Compiler */

#endif /* EN_USART1 */

/**
 * @}
 */
